EasyDP/src/resources/XML/domainRestart.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
	<env:Body>
		<dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="default">
			<dp:do-action>
				<RestartDomain>
					<Domain>SOATest</Domain>
				</RestartDomain>
			</dp:do-action>
		</dp:request>
	</env:Body>
</env:Envelope>